sulaolab/dspic33ak-audio-dsp-sonora/src/boot/resident_de_boot_main.c
#include <xc.h>
#include <stddef.h>

#include "nora_clock_dspic33ak.h"   /* AK-only: the entry oscillator-word capture */
#include "resident_de_abi.h"
#include "resident_de_arm_timing.h"
#include "resident_de_pipe.h"
#include "resident_de_mailbox.h"
#include "resident_de_boot_led.h"
#include "resident_de_boot_platform.h"
#include "resident_de_bootloader.h"

/* Consecutive idle XMODEM handshake rounds before the update wait gives up and launches
 * the installed application instead. The round shape and the resulting total live in
 * resident_de_arm_timing.h, because the application quotes that total to the operator
 * when it accepts *fu5A and the two must not drift. */
#define RESIDENT_BOOT_IDLE_ROUNDS_BEFORE_LAUNCH RESIDENT_DE_ARM_IDLE_ROUNDS

/* Which commit this image was built from, stamped by buildtools/build_resident_bootloader.ps1
 * as a bare token so it can be stringified here. One tree means one HAL, so the boot image
 * moves with the application it was built beside; the commit on the banner is what identifies
 * the pair. Building an older bootloader means checking out that commit or release tag. */
#define RESIDENT_BOOT_STR2(x) #x
#define RESIDENT_BOOT_STR(x)  RESIDENT_BOOT_STR2(x)
#if !defined(SONORA_BOOT_GIT_COMMIT)
#define SONORA_BOOT_GIT_COMMIT unknown  /* IDE builds do not go through the script. */
#endif

/* mikroBUS I2C pad selection -- and why fuses live HERE, in an image that never
 * touches I2C.
 *
 * A #pragma config is not code and is not "run" by whoever declares it: it tells
 * the linker to emit a word at a fixed flash address (FDEVOPT = 0x7F3020), which
 * the device reads AT RESET and latches for the whole run.  So these settings
 * govern the APPLICATION's pin mapping, for as long as it runs, even though the
 * bootloader itself only ever speaks UART.
 *
 * Ownership follows the address, not the user.  The application is linked into
 * its own region above this one (AK128 0x804000.., AK512 0x808000..) and delivered
 * by serial update, and a serial update writes ONLY that region -- it cannot
 * rewrite a fuse at all.  The resident bootloader is what the programmer writes,
 * so it is the only image that can guarantee a fuse.  Consequence worth stating
 * plainly: any fuse the APPLICATION depends on must be declared here.
 * src/app/main.c declares the same settings, but on a serial-update image those
 * declarations cannot take effect; treat this file as the authority and keep the
 * two in step.
 *
 * That asymmetry is exactly what the first AK128 bi-codec hardware run found
 * (2026-08-17): ALTI2C2 was here, so codec A answered on I2C2; ALTI2C1 was only
 * in main.c, so I2C1 stayed on its standard pads and codec B's device-ID read
 * failed.
 *
 * ALTI2C2 is unconditional -- both parts put codec A's mikroBUS-A SDA/SCL on the
 * I2C2 alternate pads. */
#pragma config FDEVOPT_ALTI2C2 = ON

/* ALTI2C1 is AK128-only, deliberately not unconditional: the two parts do not
 * agree on how mikroBUS-B is wired.
 *
 *   AK128  mikroBUS-B SDA/SCL = DIM-P4/P6 = ASDA1/ASCL1  -> needs ALTI2C1 = ON
 *   AK512  mikroBUS-B is on I2C3, standard pads          -> ALTI2C3 stays OFF
 *                                                           (see src/app/main.c)
 *
 * So AK512 never enables I2C1 and gains nothing here, while its fuse word is
 * part of a working, shipped image -- leave it alone.
 *
 * On AK128 this is safe for every image, not only the bi-codec one: I2C1's
 * STANDARD pads are RB3 (DIM-P13) and RB4 (DIM-P43 = S2 push button), so
 * selecting the alternates moves I2C1 off the button pad rather than onto it. */
#if defined(__dsPIC33AK128MC106__)
#pragma config FDEVOPT_ALTI2C1 = ON
#endif

/* Dual-partition boot mode, AK512-ONLY. The dsPIC33AK128MC106 has no Flash Dual
 * Partition feature and its device pack does not define these settings at all, so the
 * compiler rejects them outright ("unknown configuration setting: 'BTMODE'") rather
 * than ignoring them. Same arming, and the same reason, as src/app/main.c:126-130.
 *
 * Do not reintroduce BTMODE = DUAL on either part: the second-panel updater this once
 * served was retired with the resident bootloader, and nothing here rebuilds it. */
#if defined(__dsPIC33AK512MPS512__)
#pragma config BTMODE = SINGLE
#pragma config NOBTSWP = OFF
#elif !defined(__dsPIC33AK128MC106__)
#error "Unknown target: state whether this part has Flash Dual Partition (BTMODE/NOBTSWP)."
#endif

#if RESIDENT_BOOT_ENA_BOOT_TRACE || RESIDENT_BOOT_ENA_LAUNCH_GUARD
static void write_hex_digit(uint8_t nibble)
{
    static const char hex[] = "0123456789ABCDEF";
    resident_boot_platform_write_byte((uint8_t)hex[nibble & 0x0fu]);
}

static void write_hex32(uint32_t value)
{
    write_hex_digit((uint8_t)(value >> 28));
    write_hex_digit((uint8_t)(value >> 24));
    write_hex_digit((uint8_t)(value >> 20));
    write_hex_digit((uint8_t)(value >> 16));
    write_hex_digit((uint8_t)(value >> 12));
    write_hex_digit((uint8_t)(value >> 8));
    write_hex_digit((uint8_t)(value >> 4));
    write_hex_digit((uint8_t)value);
}
#endif

#if RESIDENT_BOOT_ENA_BOOT_TRACE
static void write_hex_words(const char *label, const uint32_t *words,
                            size_t count)
{
    size_t index;

    resident_boot_platform_write(label);
    for (index = 0u; index < count; index++) {
        if (index != 0u) {
            resident_boot_platform_write(" ");
        }
        write_hex32(words[index]);
    }
    resident_boot_platform_write("\r\n");
}
#endif

int main(void)
{
    const uint32_t reset_cause = (uint32_t)RCON;
    nora_clock_dspic33ak_raw_t entry_clock;
    const bool reset_badop = (INTCON1bits.BADOPERR != 0u);
    const bool reset_addr = (INTCON1bits.ADDRERR != 0u);
    const bool reset_stack = (INTCON1bits.STKERR != 0u);
    const bool reset_wdto = (RCONbits.WDTO != 0u);
    const bool reset_swr = (RCONbits.SWR != 0u);
    const bool reset_extr = (RCONbits.EXTR != 0u);
    const bool reset_por = (RCONbits.POR != 0u);
    const bool reset_bor = (RCONbits.BOR != 0u);
    const bool entry_dmt_on = (DMTCONbits.ON != 0u);
    const bool entry_wdt_on = (WDTCONbits.ON != 0u);
    const bool entry_dmte = (INTCON5bits.DMTE != 0u);
    resident_boot_manifest_t manifest;
    uint32_t launch_ivt;
    uint32_t launch_entry;
    uint32_t probe_token = 0u;
    uint32_t default_vector = 0u;
    uint32_t default_detail = 0u;
    uint32_t mailbox_words[4];
    uint32_t far_words[4];
    resident_boot_reset_source_trace_t source_trace;
    resident_boot_precrt_trace_t precrt_trace;
    uint16_t launch_count;
    bool update_requested;
    bool loop_suspected;
    bool installed_valid;
    bool probe_valid;
    bool source_trace_valid;
    bool default_trace_valid;
    bool force_recovery;

    /* The oscillator control words as this image was entered, before
     * resident_boot_platform_init() normalizes the clock. Taken through the
     * backend's typed capture rather than by naming the SFRs here: this record
     * depends on dsPIC33AK register layout, and the type it names says so.
     * Nothing above this line touches a clock register, so it is still the
     * entry state. */
    nora_clock_dspic33ak_raw_capture(&entry_clock);

    /* The erased FWDT configuration starts the runtime watchdog. The resident
     * image owns long blocking UART/NVM operations and does not use WDT
     * supervision, so stop it before any diagnostic or validation work. */
    WDTCONbits.ON = 0u;

    /* Reset-cause bits are sticky. Preserve the entry snapshot above, then
     * clear only the cause flags so any subsequent reset is unambiguous. */
    RCONbits.POR = 0u;
    RCONbits.BOR = 0u;
    RCONbits.EXTR = 0u;
    RCONbits.SWR = 0u;
    RCONbits.WDTO = 0u;
    RCONbits.CM = 0u;

    resident_boot_mailbox_snapshot(mailbox_words);
    resident_boot_far_sentinel_snapshot(far_words);
    resident_boot_reset_source_snapshot(&source_trace);
    resident_boot_precrt_snapshot(&precrt_trace);
    source_trace_valid = resident_boot_reset_source_trace_valid(&source_trace);
    default_trace_valid = resident_boot_default_interrupt_take(&default_vector,
                                                                &default_detail);
    default_trace_valid = reset_swr && default_trace_valid;

