sulaolab/dspic33ak-audio-dsp-sonora/src/boot/resident_de_boot_main.c
    /* A launch/probe record is meaningful only immediately after the software
     * reset used by its publisher.  Preserve every raw value above, then
     * invalidate cold/debugger/other-reset residue in C rather than letting
     * the pre-CRT observer destroy it before capture. */
    if (!reset_swr) {
        resident_boot_mailbox_invalidate();
    }
    probe_valid = reset_swr && resident_boot_probe_take(&probe_token);
    force_recovery = (reset_extr || reset_por || reset_bor) &&
                     resident_boot_platform_recovery_button_pressed();

    /* The cross-reset container, read before anything else can disturb it.
     *
     * init() establishes the container only when it cannot be trusted -- a power-on
     * class reset, or bytes belonging to a different layout version -- and leaves valid
     * records alone otherwise. That is what makes it safe to call ahead of the reads
     * below; wiping first would make an incoming message vanish with no trace.
     *
     * The cold flag is derived from the RCON snapshot taken at the top of main, not from
     * a fresh read: the cause bits are sticky and were cleared above, so a second read
     * would report nothing. */
    resident_boot_pipe_init(reset_por || reset_bor);

    /* Hand the application the reset cause it can no longer see for itself. RCON's cause
     * bits were cleared above, and the launch hand-over is another reset on top of that,
     * so without this the application reads a clean RCON every boot and reports
     * OTHER/unknown -- including straight after its own *sr. AFTER pipe_init() on purpose:
     * init() zeroes the container when it re-establishes, which would drop a record
     * published before it.
     *
     * Publish only when this pass is NOT the launch hand-over. The bootloader runs twice
     * per launch: pass 1 sees the real reset and calls launch_reset(), so pass 2 always
     * sees SWR. Publishing on pass 2 as well overwrote the real cause with the hand-over's
     * own SWR, and a genuine power cycle reached the application as "warm" -- which
     * silently switched off both power-on-only behaviours downstream (the boot-banner hold
     * and the cold WM8904 start). SWR + a record still unconsumed can only be that second
     * pass: after any boot the application actually reached, take() has already consumed
     * it, so a real *sr publishes normally. */
    if (!(reset_swr && resident_boot_pipe_cause_pending())) {
        resident_boot_pipe_cause_publish(reset_cause);
    }

    /* An update request is only meaningful immediately after the software reset its
     * publisher performed, and taking it CONSUMES it. Consuming on read is what makes
     * the wait escapable: after a timeout, or a reset button press, no request remains
     * and the application boots normally. */
    update_requested = reset_swr && resident_boot_pipe_request_take();

#if RESIDENT_BOOT_ENA_LAUNCH_GUARD
    launch_count = resident_boot_pipe_launch_count();
    loop_suspected = (launch_count > RESIDENT_BOOT_PIPE_LAUNCH_LIMIT);
#else
    launch_count = 0u;
    loop_suspected = false;
#endif

    if (!force_recovery && reset_swr &&
        resident_boot_launch_take(&launch_ivt, &launch_entry)) {
        if ((launch_ivt == RESIDENT_APP_BASE_ADDRESS) &&
            (launch_entry >= RESIDENT_APP_BASE_ADDRESS) &&
            (launch_entry < RESIDENT_MANIFEST_ADDRESS) &&
            ((launch_entry & UINT32_C(1)) == 0u)) {
            resident_boot_platform_jump_early(launch_ivt, launch_entry);
        }
        /* A corrupt/stale launch record is consumed and normal recovery below
         * revalidates Flash before another launch attempt. */
    }

    if (!resident_boot_platform_init()) {
        for (;;) {
            /* Clock/UART/timer startup failed; remain in the resident image. */
        }
    }

    /* All-off before anything can print or transfer, so a stale LAT state from
     * a prior image never shows as a lit LED. */
    resident_boot_led_init();

    /* Which boot<->app agreement this engine was built against. The application
     * prints the same number on its Delivery banner line, so a log shows whether the
     * pair matches instead of leaving it to be inferred from build dates. */
    resident_boot_platform_write("\r\nBL " RESIDENT_BOOT_STR(SONORA_BOOT_GIT_COMMIT)
                                 " DE ABI=" RESIDENT_DE_ABI_VERSION_STR "\r\n");

#if RESIDENT_BOOT_ENA_BOOT_TRACE
    resident_boot_platform_write("V=");
    if (default_trace_valid) {
        write_hex32(default_vector);
        resident_boot_platform_write("\r\nF=");
        write_hex32(default_detail);
    } else {
        resident_boot_platform_write("NONE\r\nF=NONE");
    }
    resident_boot_platform_write("\r\nT D");
    resident_boot_platform_write(entry_dmt_on ? "1" : "0");
    resident_boot_platform_write(" W");
    resident_boot_platform_write(entry_wdt_on ? "1" : "0");
    resident_boot_platform_write(" E");
    resident_boot_platform_write(entry_dmte ? "1\r\n" : "0\r\n");
#endif

    if (reset_badop) {
        resident_boot_platform_write("\r\nBL BADOP\r\n");
    } else if (reset_addr) {
        resident_boot_platform_write("\r\nBL ADDR\r\n");
    } else if (reset_stack) {
        resident_boot_platform_write("\r\nBL STACK\r\n");
    } else if (reset_wdto) {
        resident_boot_platform_write("\r\nBL WDTO\r\n");
    } else if (reset_swr) {
        resident_boot_platform_write("\r\nBL SWR\r\n");
    } else if (reset_extr) {
        resident_boot_platform_write("\r\nBL EXTR\r\n");
    } else if (reset_por) {
        resident_boot_platform_write("\r\nBL POR\r\n");
    } else if (reset_bor) {
        resident_boot_platform_write("\r\nBL BOR\r\n");
    } else {
        resident_boot_platform_write("\r\nBL OTHER\r\n");
    }
#if RESIDENT_BOOT_ENA_BOOT_TRACE
    resident_boot_platform_write("RCON raw: ");
    write_hex32(reset_cause); resident_boot_platform_write("\r\n");
    {
        /* Printed in the order the label names, which is not the capture
         * struct's field order. */
        const uint32_t entry_clock_words[6] = {
            entry_clock.oscctrl,
            entry_clock.pll1con,
            entry_clock.pll1div,
            entry_clock.pll2con,
            entry_clock.pll2div,
            entry_clock.clkfail
        };

