sulaolab/dspic33ak-audio-dsp-sonora/src/boot/resident_de_boot_main.c
        write_hex_words("Entry OSC/PLL1C/PLL1D/PLL2C/PLL2D/FAIL: ",
                        entry_clock_words, 6u);
    }
    write_hex_words("Mailbox raw: ", mailbox_words, 4u);
    write_hex_words("Far sentinel: ", far_words, 4u);
    resident_boot_platform_write("Pre-CRT: M=");
    write_hex32(precrt_trace.magic);
    resident_boot_platform_write(" RCON="); write_hex32(precrt_trace.rcon);
    resident_boot_platform_write(" MBIST="); write_hex32(precrt_trace.mbistcon);
    resident_boot_platform_write(" W15="); write_hex32(precrt_trace.w15);
    resident_boot_platform_write(" SPLIM="); write_hex32(precrt_trace.splim);
    resident_boot_platform_write(" SR="); write_hex32(precrt_trace.sr);
    resident_boot_platform_write("\r\n");
    write_hex_words("Pre-CRT A: ", precrt_trace.mailbox_a, 4u);
    write_hex_words("Pre-CRT B: ", precrt_trace.mailbox_b, 4u);
    resident_boot_platform_write("Reset source: M=");
    write_hex32(source_trace.magic);
    resident_boot_platform_write(source_trace_valid ? " VALID" : " INVALID");
    resident_boot_platform_write(" SRC="); write_hex32(source_trace.source);
    resident_boot_platform_write(" RCON="); write_hex32(source_trace.rcon);
    resident_boot_platform_write(" MBIST="); write_hex32(source_trace.mbistcon);
    resident_boot_platform_write(" ECC="); write_hex32(source_trace.ramxecccon);
    resident_boot_platform_write("/"); write_hex32(source_trace.ramyecccon);
    resident_boot_platform_write("/"); write_hex32(source_trace.pwbxecccon);
    resident_boot_platform_write("/"); write_hex32(source_trace.pwbyecccon);
    resident_boot_platform_write(" DMA="); write_hex32(source_trace.dmacon);
    resident_boot_platform_write("\r\n");
    resident_boot_platform_write("Reset MBIST bits: EN=");
    write_hex32((source_trace.mbistcon >> 0) & 1u);
    resident_boot_platform_write(" STAT=");
    write_hex32((source_trace.mbistcon >> 4) & 1u);
    resident_boot_platform_write(" DONE=");
    write_hex32((source_trace.mbistcon >> 7) & 1u);
    resident_boot_platform_write(" FLTINJ=");
    write_hex32((source_trace.mbistcon >> 8) & 1u);
    resident_boot_platform_write("\r\n");
    resident_boot_platform_write("Reset CPU: SR="); write_hex32(source_trace.sr);
    resident_boot_platform_write(" SPLIM="); write_hex32(source_trace.splim);
    resident_boot_platform_write(" W15="); write_hex32(source_trace.w15);
    resident_boot_platform_write(" INTCON="); write_hex32(source_trace.intcon1);
    resident_boot_platform_write("/"); write_hex32(source_trace.intcon3);
    resident_boot_platform_write("/"); write_hex32(source_trace.intcon4);
    resident_boot_platform_write("\r\n");
    write_hex_words("Reset IEC0..11: ", source_trace.iec, 12u);
    write_hex_words("Reset IFS0..11: ", source_trace.ifs, 12u);
    write_hex_words("Reset CLK1/6/8 CON/DIV: ", source_trace.clkgen, 6u);
    write_hex_words("Reset mailbox A: ", source_trace.mailbox_a, 4u);
    write_hex_words("Reset mailbox B: ", source_trace.mailbox_b, 4u);
    /* The probe verdict itself is NOT printed here -- it moved below the trace guard so
     * the terse build reports it too.  See the MBP= block. */
#else
    /* Captured and consumed unconditionally -- taking a record is what keeps it from
     * being read again after the next reset -- but only the trace build prints them.
     * reset_cause is no longer merely discarded here: it is forwarded to the application
     * through the pipe above, and this cast only says the terse build does not PRINT it. */
    (void)reset_cause;
    (void)entry_clock;
    (void)entry_dmt_on;
    (void)entry_wdt_on;
    (void)entry_dmte;
    (void)mailbox_words;
    (void)far_words;
    (void)source_trace;
    (void)source_trace_valid;
    (void)precrt_trace;
    (void)default_vector;
    (void)default_detail;
    (void)default_trace_valid;
#endif
    /* Terse on purpose: this image is within a few hundred bytes of full, and every
     * string is spent from that. The crash breadcrumb is deliberately NOT reported here
     * -- printf and the room for it live on the application side. */
#if RESIDENT_BOOT_ENA_LAUNCH_GUARD
    resident_boot_platform_write("LC=");
    write_hex32((uint32_t)launch_count);
    resident_boot_platform_write(loop_suspected ? " OVER\r\n" : "\r\n");
#endif

    /* Mailbox-probe verdict, printed in EVERY build (it used to live inside the
     * BOOT_TRACE block).  Without this, a *fmA5 round is unobservable in the shipped
     * terse image: "no PASS line" cannot be told apart from "probe failed", and a
     * BOOT_TRACE build cannot substitute -- it is 98.8% of the 0x8000 panel and hangs on
     * this very software-reset path (measured 2026-08-08).  Only a software reset can
     * carry a record, so cold/EXTR boots stay silent and cost nothing.
     * Same availability condition as write_hex32 above. */
#if RESIDENT_BOOT_ENA_BOOT_TRACE || RESIDENT_BOOT_ENA_LAUNCH_GUARD
    if (reset_swr) {
        if (probe_valid) {
            resident_boot_platform_write("MBP=");
            write_hex32(probe_token);
            resident_boot_platform_write("\r\n");
        } else {
            resident_boot_platform_write("MBP=none\r\n");
        }
    }
#else
    (void)probe_token;
    (void)probe_valid;
#endif

    installed_valid = resident_boot_installed_manifest(&manifest);

    /* Four reasons not to hand over. Only the first two leave the application
     * installed and bootable, which is what decides whether the wait below may give
     * up and launch it anyway. */
    if (installed_valid && !force_recovery && !update_requested && !loop_suspected) {
        /* Count this attempt before leaving. The application clears the counter once it
         * has run long enough to call the boot a success; if it never gets that far,
         * this climbs until loop_suspected stops the cycle. */
#if RESIDENT_BOOT_ENA_LAUNCH_GUARD
        resident_boot_pipe_launch_set((uint16_t)(launch_count + 1u));
#endif
        resident_boot_platform_write("Manifest OK; resetting into application.\r\n");
        resident_boot_platform_launch_reset(manifest.ivt_address,
                                            manifest.entry_address);
    }

    /* App is untouched; it boots again on timeout or reset. */
    if (update_requested) {
        resident_boot_platform_write("BL REQ\r\n");
    }

    if (force_recovery) {
        resident_boot_platform_write(
            "Button 3 held at reset; forced recovery mode.\r\n"
            "Installed application remains valid until a package header is accepted.\r\n");
    }

