sulaolab/dspic33ak-audio-dsp-sonora/src/boot/resident_de_boot_main.c
#if RESIDENT_BOOT_ENA_LAUNCH_GUARD
    /* Does NOT time out; power-cycle clears the counter and retries. */
    if (loop_suspected) {
        resident_boot_platform_write("BL LOOP\r\n");
    }
#endif

    if (!installed_valid) {
        resident_boot_platform_write("No valid application; recovery mode.\r\n");
    }

    /* Give up and launch the installed application only when there IS one to launch and
     * it is not the thing that is failing. With no valid application there is nothing to
     * fall back to, and after a launch-loop the application is the suspect -- in both
     * cases waiting forever is the safe state. */
    {
        const bool may_give_up = installed_valid && !loop_suspected;
        unsigned  idle_rounds = 0u;

        for (;;) {
            resident_boot_install_status_t status;
            /* Say what the wait is doing and how long it lasts. "Nothing is happening"
             * and "the handshake is running and you have N seconds" look identical on a
             * terminal otherwise, and the give-up figure is not guessable from here.
             * Split on may_give_up because promising a boot-away that cannot happen is
             * worse than saying nothing: with no valid application to fall back to, or
             * with the application itself under suspicion, this wait is endless by
             * design. */
            resident_boot_platform_write(
                "Sending XMODEM-CRC 'C' every " RESIDENT_DE_ARM_HANDSHAKE_S_STR
                " s -- send the .sfb package now.\r\n");
            if (may_give_up) {
                resident_boot_platform_write(
                    "If nothing is offered within about " RESIDENT_DE_ARM_TIMEOUT_S_STR
                    " s the installed application is launched again.\r\n");
            } else {
                resident_boot_platform_write(
                    "No application to fall back to: this wait does not time out.\r\n");
            }
            status = resident_boot_receive_and_install();
            if (status == RESIDENT_BOOT_INSTALL_OK) {
                resident_boot_platform_write("Update committed; resetting.\r\n");
                resident_boot_platform_reset();
            }
            /* A TRANSFER status with nobody sending is the handshake giving up, which
             * takes about 30 s. Anything else means a transfer was attempted and went
             * wrong, so the operator is present -- keep waiting for their retry rather
             * than booting away underneath them. */
            if (status == RESIDENT_BOOT_INSTALL_TRANSFER) {
                idle_rounds++;
            } else {
                idle_rounds = 0u;
                resident_boot_platform_write("Update failed; retrying recovery.\r\n");
                continue;
            }
            if (may_give_up && (idle_rounds >= RESIDENT_BOOT_IDLE_ROUNDS_BEFORE_LAUNCH)) {
        #if RESIDENT_BOOT_ENA_LAUNCH_GUARD
        resident_boot_pipe_launch_set((uint16_t)(launch_count + 1u));
#endif
                resident_boot_platform_write("BL IDLE->APP\r\n");
                resident_boot_platform_launch_reset(manifest.ivt_address,
                                                    manifest.entry_address);
            }
        }
    }
}
